Repository: abdulaziz-backend/flash
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru, uz

# welcome_message
source: 👋 Welcome to YT Insta Downloader Bot! 🌍 Choose your language:
ru: 👋 Добро пожаловать в YT Insta Downloader Bot! 🌍 Выберите язык:
uz: 👋 YT Insta Downloader botiga xush kelibsiz! 🌍 Tilni tanlang:

# language_set
source: 🌟 Great! Language set to {lang}. 🚀 What would you like to do?
ru: 🌟 Отлично! Язык установлен на {lang}. 🚀 Что бы вы хотели сделать?
uz: 🌟 Ajoyib! Til {lang} ga o'zgartirildi. 🚀 Nima qilishni xohlaysiz?

# subscription_confirmed
source: ✅ Thank you for subscribing! You can now use the bot.
ru: ✅ Спасибо за подписку! Теперь вы можете использовать бота.
uz: ✅ Obuna bo'lganingiz uchun rahmat! Endi botdan foydalanishingiz mumkin.

# subscription_required
source: ❌ You haven't subscribed yet. Please join the channel and try again.
ru: ❌ Вы еще не подписались. Пожалуйста, присоединитесь к каналу и попробуйте снова.
uz: ❌ Siz hali obuna bo'lmagansiz. Iltimos, kanalga qo'shiling va qaytadan urinib ko'ring.

# subscription_check_error
source: ❌ An error occurred. Please try again later.
ru: ❌ Произошла ошибка. Пожалуйста, попробуйте позже.
uz: ❌ Xatolik yuz berdi. Iltimos, keyinroq qayta urinib ko'ring.

# help_text
source: 🆘 Help: 1. 🔗 Send a YouTube or Instagram link to download 2. 🌍 Use /language to change the language 3. 🔄 Use /start to restart the bot 💡 Tip: You can use the buttons below for quick actions!
ru: 🆘 Помощь: 1. 🔗 Отправьте ссылку на YouTube или Instagram для скачивания 2. 🌍 Используйте /language для смены языка 3. 🔄 Используйте /start для перезапуска бота 💡 Совет: Вы можете использовать кнопки ниже для быстрых действий!
uz: 🆘 Yordam: 1. 🔗 Yuklab olish uchun YouTube yoki Instagram havolasini yuboring 2. 🌍 Tilni o'zgartirish uchun /language buyrug'idan foydalaning 3. 🔄 Botni qayta ishga tushirish uchun /start buyrug'idan foydalaning 💡 Maslahat: Tezkor harakatlar uchun quyidagi tugmalardan foydalanishingiz mumkin!

# processing_request
source: ⏳ Processing your request... Please wait.
ru: ⏳ Обрабатываем ваш запрос... Пожалуйста, подождите.
uz: ⏳ So'rovingiz qayta ishlanmoqda... Iltimos, kuting.

# download_success
source: ✅ Downloaded with YT Insta Downloader bot
ru: ✅ Скачано с помощью YT Insta Downloader bot
uz: ✅ YT Insta Downloader bot yordamida yuklab olindi

# download_failed
source: ❌ Sorry, couldn't download the media. Please check the link and try again.
ru: ❌ Извините, не удалось скачать медиа. Пожалуйста, проверьте ссылку и попробуйте снова.
uz: ❌ Kechirasiz, media yuklab olinmadi. Iltimos, havolani tekshiring va qaytadan urinib ko'ring.

# send_link
source: 🔗 Great! Please send me a YouTube or Instagram link to download.
ru: 🔗 Отлично! Пожалуйста, отправьте мне ссылку на YouTube или Instagram.
uz: 🔗 Ajoyib! Iltimos, menga YouTube yoki Instagram havolasini yuboring.

# choose_language
source: 🌍 Choose your new language:
ru: 🌍 Выберите новый язык:
uz: 🌍 Yangi tilni tanlang:

# download_button
source: 📥 Download
ru: 📥 Скачать
uz: 📥 Yuklab olish

# help_button
source: 🆘 Help
ru: 🆘 Помощь
uz: 🆘 Yordam

# change_language_button
source: 🌍 Change Language
ru: 🌍 Изменить язык
uz: 🌍 Tilni o'zgartirish

# download_more_button
source: 📥 Download more
ru: 📥 Скачать еще
uz: 📥 Ko'proq yuklab olish

# join_channel_button
source: ✅ Join Channel
ru: ✅ Присоединиться к каналу
uz: ✅ Kanalga qo'shilish

# check_subscription_button
source: 🔄 Check Subscription
ru: 🔄 Проверить подписку
uz: 🔄 Obunani tekshirish
